kab7/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
#include "furi_hal_power.h"
#include "furi_hal_bq27220.h"
#include "furi_hal_bq25896.h"
#include "furi_hal_display.h"
#include "boards/board.h"

#include <math.h>
#include <stdio.h>
#include <string.h>

#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_err.h>
#include <esp_log.h>
#include <esp_sleep.h>
#if CONFIG_PM_ENABLE
#include <esp_pm.h>
#endif
#include <soc/soc_caps.h>
#include <driver/i2c.h>
#include <esp_system.h>
#include <esp_attr.h>
#include <esp_timer.h>
#include <driver/gpio.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <furi.h>

#include "furi_hal_resources.h"

#define TAG "FuriHalPower"

#define POWER_SHUTDOWN_DIAG_MAGIC (0x50445752u) /* PDWR */

/* RTC no-init memory survives a reset/deep-sleep wake, but not a true battery
 * cut. Clear it on every boot so power diag reports only the immediately
 * preceding shutdown attempt. */
typedef struct {
    uint32_t magic;
    uint32_t magic_inverse;
    FuriHalPowerShutdownDiagnostics report;
} FuriHalPowerRtcDiagnostics;

static RTC_NOINIT_ATTR FuriHalPowerRtcDiagnostics power_shutdown_rtc_diag;
static FuriHalPowerShutdownDiagnostics power_shutdown_boot_diag;

static void furi_hal_power_shutdown_diag_init(void) {
    memset(&power_shutdown_boot_diag, 0, sizeof(power_shutdown_boot_diag));
    if(power_shutdown_rtc_diag.magic == POWER_SHUTDOWN_DIAG_MAGIC &&
       power_shutdown_rtc_diag.magic_inverse == ~POWER_SHUTDOWN_DIAG_MAGIC) {
        power_shutdown_boot_diag = power_shutdown_rtc_diag.report;
    }
    power_shutdown_rtc_diag.magic = 0;
    power_shutdown_rtc_diag.magic_inverse = 0;
    power_shutdown_boot_diag.reset_reason = (uint32_t)esp_reset_reason();
    power_shutdown_boot_diag.wakeup_cause = (uint32_t)esp_sleep_get_wakeup_cause();

    ESP_LOGW(
        TAG,
        "Boot diag: reset=%lu wake=%lu previous=%d mode=%lu stage=%lu button=%ld charger=%ld vbus=%ld ship=%ld wake_err=%ld",
        (unsigned long)power_shutdown_boot_diag.reset_reason,
        (unsigned long)power_shutdown_boot_diag.wakeup_cause,
        power_shutdown_boot_diag.has_previous_attempt,
        (unsigned long)power_shutdown_boot_diag.mode,
        (unsigned long)power_shutdown_boot_diag.stage,
        (long)power_shutdown_boot_diag.button_level,
        (long)power_shutdown_boot_diag.charger_present,
        (long)power_shutdown_boot_diag.vbus_present,
        (long)power_shutdown_boot_diag.ship_write_ok,
        (long)power_shutdown_boot_diag.wake_config_error);
}

void furi_hal_power_get_shutdown_diagnostics(FuriHalPowerShutdownDiagnostics* out) {
    furi_check(out);
    *out = power_shutdown_boot_diag;
}

static void furi_hal_power_shutdown_diag_begin(FuriHalPowerShutdownMode mode) {
    memset(&power_shutdown_rtc_diag.report, 0, sizeof(power_shutdown_rtc_diag.report));
    power_shutdown_rtc_diag.report.has_previous_attempt = true;
    power_shutdown_rtc_diag.report.mode = mode;
    power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageRequested;
    power_shutdown_rtc_diag.report.button_level = -1;
    power_shutdown_rtc_diag.report.charger_present = -1;
    power_shutdown_rtc_diag.report.vbus_present = -1;
    power_shutdown_rtc_diag.report.ship_write_ok = -1;
    power_shutdown_rtc_diag.report.wake_config_error = -1;
    power_shutdown_rtc_diag.magic_inverse = ~POWER_SHUTDOWN_DIAG_MAGIC;
    power_shutdown_rtc_diag.magic = POWER_SHUTDOWN_DIAG_MAGIC;
    ESP_LOGW(TAG, "Shutdown requested: mode=%lu", (unsigned long)mode);
}

#if CONFIG_PM_ENABLE
/* Held whenever insomnia > 0. Pins the CPU at max frequency so timing-critical
 * sections (bracketed with furi_hal_power_insomnia_enter/exit, e.g. every SPI
 * transaction) are not slowed by dynamic frequency scaling. NULL if the lock
 * could not be created, in which case insomnia becomes a no-op for DFS. */
static esp_pm_lock_handle_t furi_hal_power_freq_lock = NULL;

/* Master gate for automatic light sleep. Held by default so the SoC never
 * light-sleeps; released only when idle (screen off, on battery). Even when
 * released, IDF still only sleeps once every other lock is free (insomnia,
 * peripheral/RMT locks, the WiFi/BT drivers' own locks). */
static esp_pm_lock_handle_t furi_hal_power_no_ls_lock = NULL;
static bool furi_hal_power_ls_allowed = false;

#if CONFIG_PM_LIGHT_SLEEP_CALLBACKS
/* Optional light-sleep instrumentation. Enable CONFIG_PM_LIGHT_SLEEP_CALLBACKS
 * to compile it in; the exit callback runs in IDLE-task context and just bumps
 * these counters, which furi_hal_power_get_light_sleep_stats() exposes. */
static volatile uint32_t furi_hal_power_ls_count = 0;
static volatile uint64_t furi_hal_power_ls_total_us = 0;
static volatile uint32_t furi_hal_power_ls_wake_timer = 0;
static volatile uint32_t furi_hal_power_ls_wake_gpio = 0;
static volatile uint32_t furi_hal_power_ls_wake_other = 0;

static esp_err_t furi_hal_power_ls_exit_cb(int64_t sleep_time_us, void* arg) {
    UNUSED(arg);
    furi_hal_power_ls_count++;
    if(sleep_time_us > 0) furi_hal_power_ls_total_us += (uint64_t)sleep_time_us;
    switch(esp_sleep_get_wakeup_cause()) {
    case ESP_SLEEP_WAKEUP_TIMER: furi_hal_power_ls_wake_timer++; break;
    case ESP_SLEEP_WAKEUP_GPIO:  furi_hal_power_ls_wake_gpio++;  break;
    default:                     furi_hal_power_ls_wake_other++; break;
    }
    return ESP_OK;
}
static esp_pm_sleep_cbs_register_config_t furi_hal_power_ls_cbs = {
    .exit_cb = furi_hal_power_ls_exit_cb,
};
#endif
#endif

#define FURI_HAL_POWER_USB_PRESENT_THRESHOLD_V  (4.6f)
#define FURI_HAL_POWER_LOW_BATTERY_THRESHOLD_V  (3.35f)
#define FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V  (3.27f)
#define FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V   (4.20f)
#define FURI_HAL_POWER_ADC_DIVIDER_RATIO        (3.0f)
#define FURI_HAL_POWER_SAMPLE_REFRESH_US        (250000LL)
#define FURI_HAL_POWER_CHARGE_LIMIT_MIN_V       (3.840f)
#define FURI_HAL_POWER_CHARGE_LIMIT_MAX_V       (4.208f)
#define FURI_HAL_POWER_CHARGE_LIMIT_STEP_V      (0.016f)

